Ran Plan for 2 projects:

1. project: `apps-staging` dir: `4.apps` workspace: `staging`
1. project: `apps-prod` dir: `4.apps` workspace: `prod`

### 1. project: `apps-staging` dir: `4.apps` workspace: `staging`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:5ae03a2 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.kubero_operator[45] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding"
        name                    = "kubero-operator-manager-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[46] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding"
        name                    = "kubero-operator-proxy-rolebinding"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

  # kubernetes_secret.kubero_secrets will be created
+ resource "kubernetes_secret" "kubero_secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "kubero-secrets"
          + namespace        = "kubero-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.kubero will be updated in-place
~ resource "kubernetes_service_account" "kubero" {
        id                              = "kubero-staging/kubero"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              - "app.kubernetes.io/instance"   = "kubero" -> null
              - "app.kubernetes.io/managed-by" = "Helm" -> null
              - "app.kubernetes.io/name"       = "kubero" -> null
              - "app.kubernetes.io/version"    = "v3" -> null
              - "helm.sh/chart"                = "kubero-0.1.0" -> null
            }
            name             = "kubero"
            # (5 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fstaging)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-staging`
</details>
Plan: 1 to add, 3 to change, 0 to destroy.

---
### 2. project: `apps-prod` dir: `4.apps` workspace: `prod`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:5ae03a2 

Backend config changed or missing. Reinitializing...


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.kubero_instance will be updated in-place
~ resource "kubectl_manifest" "kubero_instance" {
        id                      = "/apis/application.kubero.dev/v1alpha1/namespaces/kubero-prod/kuberos/kubero"
        name                    = "kubero"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: application.kubero.dev/v1alpha1
            kind: Kubero
            metadata:
              annotations:
                vault.hashicorp.com/agent-inject: "true"
                vault.hashicorp.com/agent-inject-secret-env: secret/data/data/kubero
                vault.hashicorp.com/agent-inject-template-env: |
                  {{- with secret "secret/data/data/kubero" -}}
                  export KUBERO_WEBHOOK_SECRET="{{ .Data.data.KUBERO_WEBHOOK_SECRET }}"
                  export KUBERO_SESSION_KEY="{{ .Data.data.KUBERO_SESSION_KEY }}"
                  {{- end -}}
                vault.hashicorp.com/role: kubero
              name: kubero
              namespace: kubero-prod
            spec:
              image:
                pullPolicy: IfNotPresent
                repository: ghcr.io/kubero-dev/kubero/kubero
                tag: latest
              ingress:
                annotations:
                  cert-manager.io/cluster-issuer: letsencrypt-prod
          +       traefik.ingress.kubernetes.io/router.middlewares: platform-portal-auth@kubernetescrd
                className: traefik
                enabled: true
                hosts:
                - host: kcloud.zitian.party
                  paths:
                  - path: /
                    pathType: Prefix
                tls:
                - hosts:
                  - kcloud.zitian.party
                  secretName: kubero-ui-tls
              kubero:
                auth:
                  github:
                    enabled: false
                config:
                  clusterissuer: letsencrypt-prod
                  kubero:
                    admin:
                      disabled: false
                    readonly: false
                context: inClusterContext
                database:
                  accessModes:
                  - ReadWriteOnce
                  size: 1Gi
                  storageClassName: local-path
                namespace: kubero-prod
                sessionKey: cdec8218752f037eda9a6f04ea105abf1c3593e4fbdc6bfcde7863563f0084a7
              livenessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 30
                periodSeconds: 10
              readinessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 5
                periodSeconds: 5
              replicaCount: 1
              service:
                port: 2000
                type: ClusterIP
        EOT
        # (14 unchanged attributes hidden)
    }

  # kubernetes_secret.kubero_secrets will be created
+ resource "kubernetes_secret" "kubero_secrets" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "kubero-secrets"
          + namespace        = "kubero-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.kubero will be updated in-place
~ resource "kubernetes_service_account" "kubero" {
        id                              = "kubero-prod/kubero"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "meta.helm.sh/release-name"      = "kubero" -> null
              - "meta.helm.sh/release-namespace" = "kubero-prod" -> null
            }
          ~ labels           = {
              - "app.kubernetes.io/instance"   = "kubero" -> null
              - "app.kubernetes.io/managed-by" = "Helm" -> null
              - "app.kubernetes.io/name"       = "kubero" -> null
              - "app.kubernetes.io/version"    = "v3" -> null
              - "helm.sh/chart"                = "kubero-0.1.0" -> null
            }
            name             = "kubero"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-prod`
</details>
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`